backend/performance/jmeter/plans/ai/ai-analysis-load.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Backend AI Analysis Load" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="protocol" elementType="Argument"><stringProp name="Argument.name">protocol</stringProp><stringProp name="Argument.value">${__P(protocol,http)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="host" elementType="Argument"><stringProp name="Argument.name">host</stringProp><stringProp name="Argument.value">${__P(host,localhost)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="port" elementType="Argument"><stringProp name="Argument.name">port</stringProp><stringProp name="Argument.value">${__P(port,8080)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="base_path" elementType="Argument"><stringProp name="Argument.name">base_path</stringProp><stringProp name="Argument.value">${__P(base_path,)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="company_admin_username" elementType="Argument"><stringProp name="Argument.name">company_admin_username</stringProp><stringProp name="Argument.value">${__P(company_admin_username,apple.admin)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="company_admin_password" elementType="Argument"><stringProp name="Argument.name">company_admin_password</stringProp><stringProp name="Argument.value">${__P(company_admin_password,admin)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="company_api_key_updated" elementType="Argument"><stringProp name="Argument.name">company_api_key_updated</stringProp><stringProp name="Argument.value">${__P(company_api_key_updated,sk-test-updated)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="ai_threads" elementType="Argument"><stringProp name="Argument.name">ai_threads</stringProp><stringProp name="Argument.value">${__P(ai_threads,1)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="ai_loops" elementType="Argument"><stringProp name="Argument.name">ai_loops</stringProp><stringProp name="Argument.value">${__P(ai_loops,3)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="ai_ramp_up" elementType="Argument"><stringProp name="Argument.name">ai_ramp_up</stringProp><stringProp name="Argument.value">${__P(ai_ramp_up,1)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Company Admin AI Load" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${ai_loops}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${ai_threads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${ai_ramp_up}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <stringProp name="HTTPSampler.protocol">${protocol}</stringProp>
          <stringProp name="HTTPSampler.domain">${host}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Authorization" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${company_jwt}</stringProp></elementProp>
            <elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp>
            <elementProp name="Accept" elementType="Header"><stringProp name="Header.name">Accept</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Login And Configure API Key Once" enabled="true"/>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /auth/login company admin" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;username&quot;:&quot;${company_admin_username}&quot;,&quot;password&quot;:&quot;${company_admin_password}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">${base_path}/auth/login</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Company JWT" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">company_jwt</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.token</stringProp>
              <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
              <stringProp name="JSONPostProcessor.defaultValues">MISSING_COMPANY_TOKEN</stringProp>
            </JSONPostProcessor>
            <hashTree/>
          </hashTree>
          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If Login Succeeded" enabled="true">
            <stringProp name="IfController.condition">${__groovy(vars.get('company_jwt') != null &amp;&amp; vars.get('company_jwt') != 'MISSING_COMPANY_TOKEN',)}</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="PUT /api-keys/company" enabled="true">
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;apiKey&quot;:&quot;${company_api_key_updated}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.path">${base_path}/api-keys/company</stringProp>
              <stringProp name="HTTPSampler.method">PUT</stringProp>
            </HTTPSamplerProxy>
            <hashTree/>
          </hashTree>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If Auth Is Available" enabled="true">
          <stringProp name="IfController.condition">${__groovy(vars.get('company_jwt') != null &amp;&amp; vars.get('company_jwt') != 'MISSING_COMPANY_TOKEN',)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /ai/scope" enabled="true"><stringProp name="HTTPSampler.path">${base_path}/ai/scope</stringProp><stringProp name="HTTPSampler.method">GET</stringProp></HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /ai/analysis" enabled="true"><stringProp name="HTTPSampler.path">${base_path}/ai/analysis</stringProp><stringProp name="HTTPSampler.method">GET</stringProp></HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /ai/reports" enabled="true"><stringProp name="HTTPSampler.path">${base_path}/ai/reports</stringProp><stringProp name="HTTPSampler.method">GET</stringProp></HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>